<template>
    <section class="pa-5">
        <h2 class="text-h2 text-center">～歡迎來到以預訓練模型結合餘弦相似度擬合小樣本問題專題～</h2>
        <v-row justify="center">
            <v-col cols="12" md="6">
                <p>
                    人工智慧的時代已經來臨，生活中各個領域都已能處處見到人工智慧的影子，從最常見的物聯網，智慧家電，再到網路上的google搜尋引擎，各大商城的廣告推送，甚至是對產線上的物件進行分類，都已經不再需要由人類來完成這些工作，應用越來越廣泛，各大公司已經在虛擬世界進行如火如荼的資料軍備競賽，那麼中小型企業又要如何在這個資料飢餓的環境下生存？
                </p>
                <p>
                    除了資料飢餓，人工標注樣本也是一件不容易且花費成本的事情，當然架構若使用Yolo或是RCNN等等架構能夠把特徵提取的非常好，但取而代之的是需要花費大量人力去把目標區域框起來，既然模型這麼聰明，那麼我們為什麼還得要使用這樣原始的方法對樣本進行標注呢？
                </p>
                <p>
                    於是我實作這個專題，旨在探討如何以更小的資料對一個廣泛的資料及做分類，這個專題將作為我一個對few shot learning甚至zero shot learning研究的開端，並且讓這個模型到AI
                    CUP 2022實戰並測試其效能，讓這個專案能夠展現較為實際的成果。
                </p>
                <p>
                    關鍵字：資料競爭，小樣本學習，預訓練模型，零次學習，機器學習，深度學習，特徵映射，AI CUP 2022，餘弦相似度。
                </p>
            </v-col>
        </v-row>
    </section>
</template>
