<template>
    <section class="pa-5">
        <h2 class="text-h2 test text-center">總結</h2>

        <v-row justify="center">
            <v-col cols="12" md="6">
                <p>
                    此模型以預訓練模型結合餘弦相似度對task做分類可以使模型在較少的樣本中有較好的表現，且具有以下特色：
                </p>
                <ul>
                    <li>
                        架構簡單，實現容易：
                        <p>整個模型架構僅包含一個預訓練模型與一個分類器，在實現上僅需要將預訓練模型的輸出作為分類器的輸入，並以support set經過預訓練模型的矩陣對分類器的權重做初始化即可。</p>
                    </li>
                    <li>
                        訓練所需內存不高：
                        <p>若設備算力與虛擬記憶體大小都較低，也可以藉由鎖定預訓練模型的權重讓模型在fit階段不對預訓練模型的權重做更新，僅更新分類器的權重也能達到不錯的效果。</p>
                    </li>
                    <li>
                        減少資料用量：
                        <p>尋找特徵向量的距離相對於尋找輸入與輸出的關係較容易訓練，所以可以以較少的資料達到相同的效能。</p>
                    </li>
                    <li>
                        仰賴特徵提取器：
                        <p>
                            在特徵空間S裡，分類器僅能以向量間的角度來判斷類別的不同，而這些向量都是由特徵提取器預測出來的，若特徵提取器預測的兩個異類別的夾角很小，那麼分類器再怎麼樣都很難把兩個異類別分辨出來，影響模型表現最主要的原因還是特徵提取器。
                        </p>
                    </li>
                    <li>
                        不受到資料尺度影響：
                        <p>
                            由於餘弦相似度公式會對兩向量做歸一化，所以即使以尺度為0到255的彩圖對模型進行訓練也不影響其對尺度為0到1的圖做預測。
                        </p>
                    </li>
                    <li>
                        準確度與資料成正關係：
                        <p>
                            在這個模型中，越多的樣本做參考可以讓模型找到越能代表該類別的特徵向量，預測的準確度也會隨之大幅提升。
                        </p>
                    </li>
                </ul>
            </v-col>
        </v-row>
    </section>
</template>
